import telebot
import random

bot = telebot.TeleBot('5062854958:AAHtuVKSRmgeQc9ct2Zbc_ZuisIO5pkWpv4');

memlist = ["Эффективность импортозамещения мы заменили его зрелищностью.",
           "Наступило время терпилоидов.",
           "Теперь пассажиры, улетающие из России в один конец, хлопают после взлета.",
           "В России стало так плохо с юмором, что пора уже брать Одессу"]


@bot.message_handler(content_types=['text'])
@bot.message_handler(content_types=['text', 'document', 'audio'])
def get_text_messages(message):
    if message.text == "Привет":
        bot.send_message(message.chat.id, "Привет, чем я могу тебе помочь?")

    elif message.text == "!команды":
        bot.send_message(message.chat.id, """|!расп понедельник и т.д|\n|!звонки|\n|!преподы|\n|!студенты|""")

    elif message.text == "!мем":
        bot.send_message(message.chat.id, random.choice(memlist))

    elif message.text == "!студенты":
        bot.send_message(message.chat.id, """1. Боброва
Дарья
Николаевна
VK: https://vk.com/id546009238
TG:
---------------------------------------------------------
2. Головач
Никита
Сергеевич
VK: https://vk.com/id310729829
TG:
---------------------------------------------------------
3. Дорох
Артём
Анатольевич
VK: https://vk.com/id0?149282990
TG:
---------------------------------------------------------
4. Зайковский
Владислав
Сергеевич
VK: https://vk.com/id442854234
TG:
---------------------------------------------------------
5. Зелёных
Станислав
Сергеевич
VK: https://vk.com/id540676663
TG:
---------------------------------------------------------
6. Ильющиц
Кирилл
Сергеевич
VK: https://vk.com/id318285876
TG:
---------------------------------------------------------
7. Кирикович
Артём
Иванович
VK: https://vk.com/id397061905
TG:
---------------------------------------------------------
8. Козлов
Дмитрий
Владимирович
VK: https://vk.com/id424096592
TG:
---------------------------------------------------------
9. Коршунов
Еремей
Васильевич
VK: https://vk.com/id666615143
TG:
---------------------------------------------------------
10. Король
Максим
Викторович
VK: https://vk.com/id154232205
TG:
---------------------------------------------------------
11. Кудравец
Иван
Михайлович
VK: https://vk.com/id177719312
TG:
---------------------------------------------------------
12. Мороз
Анастасия
Александровна
VK: https://vk.com/id259223391
TG:
---------------------------------------------------------
13. Мухин
Сергей
Анатольевич
VK: https://vk.com/id294586223
TG:
---------------------------------------------------------
14. Пилипейко
Александр
Сергеевич
VK: https://vk.com/id206990245
TG:
---------------------------------------------------------
15. Полын
Серафим
Иванович
VK: https://vk.com/id507846916
TG:
---------------------------------------------------------
16. Фёдорова
Ангелина
Вячеславова
VK: https://vk.com/id275351849
TG:
---------------------------------------------------------
17. Фещенко
Евгений
Вячеславович
VK: https://vk.com/id162500280
TG:
---------------------------------------------------------
18. Хомутовский
Илья
Владимирович
VK: https://vk.com/id50338132
TG:
---------------------------------------------------------
19. Чуравский
Андрей
Юрьевич
VK: https://vk.com/id174453550
TG:
---------------------------------------------------------
20. Шевко
Наталья
Геннадьевна
VK: https://vk.com/id384854302
TG:
---------------------------------------------------------
21. Шмавгонец
Анастасия
Вадимовна
VK: https://vk.com/id172696593
TG:
---------------------------------------------------------""")

    elif message.text == "!преподы":
        bot.send_message(message.chat.id, """Староста
Шмавгонец Анастасия Вадимовна 
+375255206011
---------------------------------------------------------
Куратор
Гуцко Наталья Викторовна
+375291945374
---------------------------------------------------------
Декан
Ковальчук Инесса Николаевна
+375297357672
---------------------------------------------------------""")

    elif message.text == "!расп понедельник":
        bot.send_message(message.chat.id, """Понедельник🗓️
1️⃣Молекулярная физика(лк)
2️⃣ТФКП(лк)
3️⃣ТФКП(пр)
4️⃣1гр. - ничего, 2гр. - Молекулярная физика(лб)
﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿﻿﻿""")

    elif message.text == "!расп вторник":
        bot.send_message(message.chat.id, """Вторник🗓️
1️⃣Физическая культура и здоровье
2️⃣ДУ(лк)
3️⃣ДУ(пр)
4️⃣1гр. - Английский язык, 2гр. - ничего
﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿""")

    elif message.text == "!расп среда":
        bot.send_message(message.chat.id, """Среда🗓️
⬆️Числитель⬆️(верх): 
1️⃣Молекулярная физика(лк)
2️⃣Молекулярная физика(пр)
3️⃣1гр. - Программирование(лб), 2гр.- Английский язык
4️⃣Ничего
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
⬇️Знаменатель⬇️(низ)
1️⃣Молекулярная физика(пр)
2️⃣Проблемы физики(лк)
3️⃣1гр. - Программирование(лб), 2гр.- Английский язык
4️⃣Программирование(лк)
﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿""")

    elif message.text == "!расп четверг":
        bot.send_message(message.chat.id, """Четверг🗓️
﻿⬆️Числитель⬆️(верх)
1️⃣1гр. - Английский язык, 2гр. - Молекулярная физика(лб)
2️⃣1гр. - Программирование(лб), 2гр. - Английский язык
3️⃣Физическая культура
4️⃣1гр. - ничего, 2гр. - Программирование(лб)
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
⬇️Знаменатель⬇️(низ)
1️⃣1гр. - Английский язык, 2гр. - Молекулярная физика(лб)
2️⃣1гр. - Программирование(лб), 2гр. - Английский язык
3️⃣Физическая культура
4️⃣1гр. - Молекулярная физика(лб), 2гр. - Программирование(лб)
➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿""")
    elif message.text == "!расп пятница":

        bot.send_message(message.chat.id, """Пятница🗓️
⬆️Числитель⬆️(верх)
1️⃣Ничего
2️⃣Молекулярная физика(пр)
3️⃣1гр. - Основы информационных технологий, 2гр. - Программирование(лб)
4️⃣1гр. - Молекулярная физика(лб), 2гр. - Основы информационных технологий
〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
⬇️Знаменатель⬇️(низ)
1️⃣Ничего
2️⃣Проблемы физики(пр)
3️⃣1гр. - Основы информационных технологий, 2гр. - Программирование(лб)	
4️⃣1гр. - Молекулярная физика(лб), 2гр. - Основы информационных технологий
➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖﻿﻿➖""")

    elif message.text == "!звонки":
        bot.send_message(message.chat.id, """1️⃣ смена
1 пара
8:30 - 9:15
9:20 - 10:05
----------------------------------
2 пара
10:20 - 11:05
11:10 - 11:55
----------------------------------
3 пара
12:20 - 13:05
13:10 - 13:55
----------------------------------
2️⃣ смена
4 пара
14:10 - 14:55
15:00 - 15:45
----------------------------------
5 пара
16:00 - 16:45
16:50 - 17:35
----------------------------------
6 пара
18:00 - 18:45
18:50 - 19:35
----------------------------------
7 пара
19:50 - 20:35
20:40 - 21:25
----------------------------------""")


#    else:
#        bot.send_message(message.chat.id, "Я тебя не понимаю. Напиши /help.")


bot.polling(none_stop=True, interval=0)
